emas/loadtest/emas-performance-report/raw_data/sp1/apache_bench_data/250cus/varnish_ab_test_250_1000000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      250
Time taken for tests:   56.270 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Total transferred:      32552000000 bytes
HTML transferred:       31966000000 bytes
Requests per second:    17771.48 [#/sec] (mean)
Time per request:       14.067 [ms] (mean)
Time per request:       0.056 [ms] (mean, across all concurrent requests)
Transfer rate:          564938.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   0.7      6      13
Processing:     3    8   7.9      8     672
Waiting:        0    3   7.9      3     663
Total:          6   14   7.9     14     677

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     14
  80%     14
  90%     15
  95%     15
  98%     17
  99%     18
 100%    677 (longest request)